<?php
if ((isset($_POST["MM_insert"])) && ($_POST["MM_insert"] == "fmadd")) {
require_once("inc/func.php");
$name = stripslashes($_POST["name"]);
$affiliation = stripslashes($_POST["affiliation"]);
$meeting_name = stripslashes($_POST["meeting_name"]);
$date = Day_show($_POST["date"]);
$date1 = Day_show($_POST["date1"]);
$date2 = Day_show($_POST["date2"]);
$date3 = Day_show($_POST["date3"]);

$day_join = stripslashes($_POST["day_join"]);

$place1 = stripslashes($_POST["place1"]);
$place2 = stripslashes($_POST["place2"]);
$place3 = stripslashes($_POST["place3"]);

$wish1 = number_format($_POST["wish1"]);
$wish2 = number_format($_POST["wish2"]);
$wish3 = number_format($_POST["wish3"]);

$btnradio1 = stripslashes($_POST["btnradio1"]);
$btnradio2 = stripslashes($_POST["btnradio2"]);
$btnradio5 = stripslashes($_POST["btnradio5"]);

$meeting = stripslashes($_POST["meeting"]);
$meeting_name1 = stripslashes($_POST["meeting_name1"]);
$other1 = ($_POST["other1"]);
$othor2 = ($_POST["othor2"]);
$objective= ($_POST["objective"]);
$suggestion = stripslashes($_POST["suggestion"]);

$line_space = 7;

require('vendor/fpdf184/fpdf.php');
$pdf = new FPDF('P','mm','A4');
$pdf->SetMargins(9,6);
$pdf->SetAutoPageBreak(10);
$pdf->AddPage();
$pdf->AddFont('THSarabun','B','THSarabun Bold.php');//ธรรมดา
$pdf->AddFont('THSarabun','','THSarabun.php');//ธรรมดา

//ด้านบน
$pdf->Image('image/ahs-logo.png',15,4,28,24);

$pdf->setfont('THSarabun','B','18');
$pdf->Cell(47);
$pdf->Cell(55,$line_space+3,iconv("UTF-8", "TIS-620",'แบบสรุปผลการเข้าร่วมประชุมวิชาการ อบรม สัมมนา ดูงาน'),0,1);

$pdf->setfont('THSarabun','B','16');
$pdf->Cell(80);
$pdf->Cell(55,$line_space-3,iconv("UTF-8", "TIS-620",'บุคลากรสายสนับสนุน'),0,1);

$pdf->Cell(65);
$pdf->Cell(55,$line_space+3,iconv("UTF-8", "TIS-620",'คณะสหเวชศาสตร์ มหาวิทยาลัยนเรศวร'),0,1);

$pdf->setfont('THSarabun','B','14');
//เส้นกรอบ
$pdf->SetLineWidth(0.2);
$pdf->Rect(10,34,190,175);

//เส้นแรก
$pdf->SetLineWidth(0.2);
$pdf->Rect(10,49,190,0);

//เส้นสอง
$pdf->SetLineWidth(0.2);
$pdf->Rect(10,62,190,0);

//เส้นสาม
$pdf->SetLineWidth(0.2);
$pdf->Rect(10,77,190,0);

//เส้นสี่
$pdf->SetLineWidth(0.2);
$pdf->Rect(10,103,190,0);

//เส้นห้า
$pdf->SetLineWidth(0.2);
$pdf->Rect(10,124,190,0);

//เส้นหก
$pdf->SetLineWidth(0.2);
$pdf->Rect(10,146,190,0);

//เส้นเจ็ด
$pdf->SetLineWidth(0.2);
$pdf->Rect(10,174,190,0);

$pdf->Cell(55,$line_space-2,iconv("UTF-8", "TIS-620",''),0,1);
$pdf->Cell(3);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'ชื่อ-สกลุ ผู้เขียนรายงาน '),0,1);

$pdf->Cell(3);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'สังกัด'),0,1);

$pdf->Cell(3);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'ชื่อการประชุมวิชาการ/อบรม/สัมมนา/ดูงาน'),0,1);

$pdf->setfont('THSarabun','','14');
$pdf->Cell(3);
$pdf->Cell(15,$line_space-2,iconv("UTF-8", "TIS-620",'.....................................................................................................................................................................................................................................'),0,1);

$pdf->setfont('THSarabun','B','14');

$pdf->Cell(3);
$pdf->Cell(15,$line_space+2,iconv("UTF-8", "TIS-620",'วัน/เดือน/ปี'),0,1);

$pdf->Cell(3);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'จำนวนวันทั้งหมดที่เข้าร่วม                                                      วัน'),0,1);

$pdf->Cell(3);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'ชื่อสถานที่ดำเนินการประชุมวิชาการ/อบรม/สัมมนา/ดูงาน'),0,1);

$pdf->setfont('THSarabun','','14');

$pdf->Cell(3);
$pdf->Cell(15,$line_space-1,iconv("UTF-8", "TIS-620",'สถานที่........................................................................................................................................................................................................................'),0,1);

$pdf->Cell(3);
$pdf->Cell(15,$line_space-1,iconv("UTF-8", "TIS-620",'เมือง/จังหวัด...............................................................................................................................................................................................................'),0,1);

$pdf->Cell(3);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'ประเทศ.......................................................................................................................................................................................................................'),0,1);

$pdf->setfont('THSarabun','B','14');
$pdf->Cell(3);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'งบประมาณที่ใช้จริง'),0,1);

$pdf->setfont('THSarabun','','14');
$pdf->Cell(3);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'1. งบประมาณแผ่นดิน                                  2. งบประมาณรายได้ (ภาควิชา/ สำนักงาน)      3. จากแหล่งอื่น (ระบุ) ............................'),0,1);

$pdf->Cell(3);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'จำนวน .................................................. บาท        จำนวน .................................................. บาท    จำนวน ................................................ บาท'),0,1);

$pdf->setfont('THSarabun','B','14');
$pdf->Cell(3);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'ความสอดคล้องกับแผนยุทธศาสตร์คณะ'),0,1);

$pdf->setfont('THSarabun','','14');
$pdf->Cell(3);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'แผนยุทธศาสตร์ที่                   แผนยุทธศาสตร์ที่ 5 งานได้ผลคนเป็นสุข'),0,1);

$pdf->Cell(46);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'อื่นๆ ...............................................................................................................................................................'),0,1);

$pdf->setfont('THSarabun','B','14');
$pdf->Cell(3);
$pdf->Cell(15,$line_space+2,iconv("UTF-8", "TIS-620",'การถ่ายทอดความรู้ที่ได้จากการประชุมวิชาการ/อบรม/สัมมนา ดูงาน'),0,1);

$pdf->setfont('THSarabun','','14');
$pdf->Cell(12);
$pdf->Cell(15,$line_space-2,iconv("UTF-8", "TIS-620",'ถ่ายทอดความรู้แล้ว ในการประชุม.............................................................. เมื่อวันที่.........................................................'),0,1);

$pdf->Cell(12);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'ยังไม่ได้ถ่ายทอด โดยจะดำเนินการถ่ายทอดความรู้ในการประชุม...................................................... วันที่...........................................'),0,1);

$pdf->Cell(12);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'อื่นๆ ................................................................................................................................................................................................................'),0,1);

$pdf->Cell(15,$line_space-2,iconv("UTF-8", "TIS-620",''),0,1);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",''),0,1);

$pdf->Cell(50);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'ลงชื่อ ....................................................................................ผู้รายงาน'),0,1);

$pdf->Cell(55);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'(.........................................................................................)'),0,1);

$pdf->Cell(55);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'วัน/เดือน/ปีที่รายงาน.......................................................'),0,1);

$pdf->setfont('THSarabun','','14');
//เส้นกรอบบน
$pdf->SetLineWidth(0.2);
$pdf->Rect(170,5,30,8);

$pdf->setxy(171,4);
$pdf->Cell(55,$line_space+3,iconv("UTF-8", "TIS-620",'เอกสารหมายเลข 1'),0,1);

$pdf->setfont('THSarabun','','14');

//ชื่อ-นามสกุล
$pdf->setxy(43,35.2);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'..............................................................................................................................................................................................'),0,1);

//สังกัด
$pdf->setxy(20,42);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'...........................................................................................................................................................................................................................'),0,1);

//วัน/เดือน/ปี

$pdf->setxy(28,62);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'....................................................................................................'),0,1);

//จำนวนวันทั้งหมดที่เข้าร่วม 
$pdf->setxy(48,70.5);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'............................................................................'),0,1);

$pdf->Cell(55);
$pdf->Cell(15,$line_space+130,iconv("UTF-8", "TIS-620",''),0,1);
$pdf->setfont('THSarabun','BU','14');
$pdf->Cell(2);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'ความเห็นของหัวหน้าภาควิชา/หัวหน้าสำนักงาน'),0,0);

$pdf->Cell(90);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'ความเห็นของคณบดี'),0,1);

$pdf->setfont('THSarabun','','14');
$pdf->Cell(2);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'............................................................................................'),0,0);

$pdf->Cell(90);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'............................................................................................'),0,1);
$pdf->Cell(2);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'............................................................................................'),0,0);

$pdf->Cell(90);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'............................................................................................'),0,1);

$pdf->Cell(2);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'ลงชื่อ...................................................................................'),0,0);

$pdf->Cell(90);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'ลงชื่อ...................................................................................'),0,1);

$pdf->Cell(2);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'     (...................................................................................)'),0,0);

$pdf->Cell(90);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'     (...................................................................................)'),0,1);

$pdf->Cell(2);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'ตำแหน่ง..............................................................................'),0,0);

$pdf->Cell(90);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'ตำแหน่ง..............................................................................'),0,1);

$pdf->Cell(2);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'วัน/เดือน/ปี........................................................................'),0,0);

$pdf->Cell(90);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'วัน/เดือน/ปี........................................................................'),0,1);

$pdf->SetXY(48,133);
$pdf->Cell(4,4,'',1,0);

$pdf->SetXY(48,140);
$pdf->Cell(4,4,'',1,0);

$pdf->SetXY(15,155);
$pdf->Cell(4,4,'',1,0);

$pdf->SetXY(15,161);
$pdf->Cell(4,4,'',1,0);

$pdf->SetXY(15,167);
$pdf->Cell(4,4,'',1,0);


$pdf->SetFont('THSarabun','',14);
$pdf->setxy(50,34);
$pdf->Cell(40,$line_space,iconv("UTF-8", "TIS-620",$name),0,0);

$pdf->setxy(30,41);
$pdf->Cell(40,$line_space,iconv("UTF-8", "TIS-620",$affiliation),0,0);

$pdf->setxy(20,54);
$pdf->Cell(40,$line_space,iconv("UTF-8", "TIS-620",$meeting_name),0,0);

$pdf->setxy(35,61);
$pdf->Cell(40,$line_space,iconv("UTF-8", "TIS-620",$date),0,0);

$pdf->setxy(65,69);
$pdf->Cell(40,$line_space,iconv("UTF-8", "TIS-620",$day_join),0,0);

$pdf->setxy(30,82);
$pdf->Cell(40,$line_space,iconv("UTF-8", "TIS-620",$place1),0,0);

$pdf->setxy(32,88.5);
$pdf->Cell(40,$line_space,iconv("UTF-8", "TIS-620",$place2),0,0);

$pdf->setxy(30,95);
$pdf->Cell(40,$line_space,iconv("UTF-8", "TIS-620",$place3),0,0);

$pdf->setxy(170,109);
$pdf->Cell(40,$line_space,iconv("UTF-8", "TIS-620",$other1),0,0);

$pdf->setxy(32,116);
$pdf->Cell(40,$line_space,iconv("UTF-8", "TIS-620",$wish1),0,0);

$pdf->setxy(100,116);
$pdf->Cell(40,$line_space,iconv("UTF-8", "TIS-620",$wish2),0,0);

$pdf->setxy(160,116);
$pdf->Cell(40,$line_space,iconv("UTF-8", "TIS-620",$wish3),0,0);

if($btnradio1==1){
    $pdf->Image('image/check.png',48,131.5,5,6);
}else {
    $pdf->Image('image/check.png',48,138.5,5,6);
}

$pdf->setxy(67,136.5);
$pdf->Cell(40,$line_space,iconv("UTF-8", "TIS-620",$othor2),0,0);



if($btnradio2==1){
    $pdf->Image('image/check.png',15,153.5,5,6);
}elseif ($btnradio2==2) {
    $pdf->Image('image/check.png',15,160,5,6);
} else {
    $pdf->Image('image/check.png',15,165.5,5,6);
}

$pdf->setxy(67,152);
$pdf->Cell(40,$line_space,iconv("UTF-8", "TIS-620",$meeting ),0,0);

$pdf->setxy(132,152);
$pdf->Cell(40,$line_space,iconv("UTF-8", "TIS-620",$date1),0,0);

$pdf->setxy(105,158);
$pdf->Cell(40,$line_space,iconv("UTF-8", "TIS-620",$meeting_name1 ),0,0);

$pdf->setxy(155,158);
$pdf->Cell(40,$line_space,iconv("UTF-8", "TIS-620",$date2),0,0);


$pdf->setxy(30,165);
$pdf->Cell(40,$line_space,iconv("UTF-8", "TIS-620",$other1),0,0);

$pdf->setxy(70,191);
$pdf->Cell(40,$line_space,iconv("UTF-8", "TIS-620",$name),0,0);

$pdf->setxy(95,198);
$pdf->Cell(40,$line_space,iconv("UTF-8", "TIS-620",$date3),0,0);


//หน้า 2
$pdf->AddPage();
$pdf->AddFont('THSarabun','B','THSarabun Bold.php');//ธรรมดา
$pdf->AddFont('THSarabun','','THSarabun.php');//ธรรมดา

$pdf->setfont('THSarabun','','14');
//เส้นกรอบบน
$pdf->SetLineWidth(0.2);
$pdf->Rect(170,4,30,8);

$pdf->setxy(171,4);
$pdf->Cell(55,$line_space+3,iconv("UTF-8", "TIS-620",'เอกสารหมายเลข 2'),0,1);

//เส้นกรอบ
$pdf->SetLineWidth(0.2);
$pdf->Rect(10,12,190,160);

//เส้นแรก
$pdf->SetLineWidth(0.2);
$pdf->Rect(10,92,190,0);

//เส้นแรก
$pdf->SetLineWidth(0.2);
$pdf->Rect(10,120,190,0);

$pdf->setfont('THSarabun','B','14');
$pdf->Cell(3);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'เนื้อหาการถ่ายทอดองค์ความรู้'),0,1);

$pdf->setfont('THSarabun','','14');
$pdf->Cell(3);
$pdf->Cell(15,$line_space-2,iconv("UTF-8", "TIS-620",'.....................................................................................................................................................................................................................................'),0,1);
$pdf->Cell(3);
$pdf->Cell(15,$line_space-2,iconv("UTF-8", "TIS-620",'.....................................................................................................................................................................................................................................'),0,1);
$pdf->Cell(3);
$pdf->Cell(15,$line_space-2,iconv("UTF-8", "TIS-620",'.....................................................................................................................................................................................................................................'),0,1);
$pdf->Cell(3);
$pdf->Cell(15,$line_space-2,iconv("UTF-8", "TIS-620",'.....................................................................................................................................................................................................................................'),0,1);
$pdf->Cell(3);
$pdf->Cell(15,$line_space-2,iconv("UTF-8", "TIS-620",'.....................................................................................................................................................................................................................................'),0,1);
$pdf->Cell(3);
$pdf->Cell(15,$line_space-2,iconv("UTF-8", "TIS-620",'.....................................................................................................................................................................................................................................'),0,1);
$pdf->Cell(3);
$pdf->Cell(15,$line_space-2,iconv("UTF-8", "TIS-620",'.....................................................................................................................................................................................................................................'),0,1);
$pdf->Cell(3);
$pdf->Cell(15,$line_space-2,iconv("UTF-8", "TIS-620",'.....................................................................................................................................................................................................................................'),0,1);
$pdf->Cell(3);
$pdf->Cell(15,$line_space-2,iconv("UTF-8", "TIS-620",'.....................................................................................................................................................................................................................................'),0,1);
$pdf->Cell(3);
$pdf->Cell(15,$line_space-2,iconv("UTF-8", "TIS-620",'.....................................................................................................................................................................................................................................'),0,1);
$pdf->Cell(3);
$pdf->Cell(15,$line_space-2,iconv("UTF-8", "TIS-620",'.....................................................................................................................................................................................................................................'),0,1);
$pdf->Cell(3);
$pdf->Cell(15,$line_space-2,iconv("UTF-8", "TIS-620",'.....................................................................................................................................................................................................................................'),0,1);
$pdf->Cell(3);
$pdf->Cell(15,$line_space-2,iconv("UTF-8", "TIS-620",'.....................................................................................................................................................................................................................................'),0,1);
$pdf->Cell(3);
$pdf->Cell(15,$line_space-2,iconv("UTF-8", "TIS-620",'.....................................................................................................................................................................................................................................'),0,1);

$pdf->setfont('THSarabun','B','14');
$pdf->Cell(3);
$pdf->Cell(15,$line_space+2,iconv("UTF-8", "TIS-620",'ข้อเสนอแนะของการนำองค์ความรู้ไปใช้ประโยชน์'),0,1);

$pdf->setfont('THSarabun','','14');
$pdf->Cell(3);
$pdf->Cell(15,$line_space-2,iconv("UTF-8", "TIS-620",'.....................................................................................................................................................................................................................................'),0,1);
$pdf->Cell(3);
$pdf->Cell(15,$line_space-2,iconv("UTF-8", "TIS-620",'.....................................................................................................................................................................................................................................'),0,1);
$pdf->Cell(3);
$pdf->Cell(15,$line_space-2,iconv("UTF-8", "TIS-620",'.....................................................................................................................................................................................................................................'),0,1);
$pdf->Cell(3);
$pdf->Cell(15,$line_space-2,iconv("UTF-8", "TIS-620",'.....................................................................................................................................................................................................................................'),0,1);

$pdf->setfont('THSarabun','B','14');
$pdf->Cell(3);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'การเผยแพร่เอกสาร'),0,1);

$pdf->setfont('THSarabun','','14');
$pdf->Cell(10);
$pdf->Cell(15,$line_space-2,iconv("UTF-8", "TIS-620",'ประสงค์เผยแพร่เอกสาร และขอรับรองว่าไม่ละเมิดลิขสิทธิ์ด้านเอกสารหรือรูปภาพ'),0,1);

$pdf->Cell(10);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'ไม่ประสงค์เผยแพร่'),0,1);

$pdf->Cell(15,$line_space-2,iconv("UTF-8", "TIS-620",''),0,1);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",''),0,1);
$pdf->Cell(50);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'ลงชื่อ ....................................................................................ผู้รายงาน'),0,1);

$pdf->Cell(55);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'(.........................................................................................)'),0,1);

$pdf->Cell(55);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'วัน/เดือน/ปีที่รายงาน.......................................................'),0,1);


$pdf->setfont('THSarabun','BU','14');
$pdf->Cell(2);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'ความเห็นของหัวหน้าภาควิชา/หัวหน้าสำนักงาน'),0,0);

$pdf->Cell(90);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'ความเห็นของคณบดี'),0,1);

$pdf->setfont('THSarabun','','14');
$pdf->Cell(10);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'รับทราบและเห็นควรเผยแพร่/จัดเก็บองค์ความรู้ ทาง '),0,0);

$pdf->Cell(82);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'............................................................................................'),0,1);
$pdf->Cell(20);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'เว็บไซต์คณะ                  ระบบ MIS'),0,0);

$pdf->Cell(72);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'...........................................................................................'),0,1);

$pdf->Cell(10);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'รับทราบและไม่เห็นควรให้เผยแพร่องค์ความรู้'),0,0);

$pdf->Cell(82);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'...........................................................................................'),0,1);

$pdf->Cell(2);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'เนื่องจาก................................................................................'),0,0);

$pdf->Cell(82);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",''),0,1);

$pdf->Cell(2);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'ความเห็นอื่นๆ (ถ้ามี)'),0,0);

$pdf->Cell(90);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'ลงชื่อ...................................................................................'),0,1);

$pdf->Cell(2);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'...............................................................................................'),0,0);

$pdf->Cell(90);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'     (...................................................................................)'),0,1);

$pdf->Cell(17);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",''),0,0);

$pdf->Cell(75);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'ตำแหน่ง..............................................................................'),0,1);

$pdf->Cell(5);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'ลงชื่อ..................................................................... '),0,0);

$pdf->Cell(88);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'วัน/เดือน/ปี........................................................................'),0,1);

$pdf->Cell(12);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'(.................................................................)'),0,1);

$pdf->Cell(5);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",'วัน/เดือน/ปี.......................................................'),0,1);

$pdf->Cell(5);
$pdf->Cell(15,$line_space,iconv("UTF-8", "TIS-620",''),0,1);

$pdf->setfont('THSarabun','B','12');
$pdf->Cell(5);
$pdf->Cell(500,$line_space,iconv("UTF-8", "TIS-620",'เอกสารหมายเลข 2 เพื่อใช้ประกอบการประเมินผลการปฏิบัติราชการของบุคลากรสายสนับสนุน'),0,1);

$pdf->setfont('THSarabun','','12');
$pdf->Cell(5);
$pdf->Cell(500,$line_space,iconv("UTF-8", "TIS-620",'ข้อ 1.2.1 งานนวัตกรรมและพัฒนา "การจัดทำเอกสารสรุปความรู้ที่ได้จากการไปเข้าร่วมอบรมและสัมมนา โดยจัดทำเป็นเอกสารสรุปความรู้เพื่อเผยแพร่"'),0,1);

$pdf->Cell(5);
$pdf->Cell(500,$line_space,iconv("UTF-8", "TIS-620",'ตามประกาศคณะสหเวชศาสตร์ มหาวิทยาลัยนเรศวร เรื่อง หลักเกณฑ์การประเมินผลการปฏิบัติราชการ (Merit of work) ของบุคลากรสายสนับสนุน'),0,1);

$pdf->Cell(5);
$pdf->Cell(500,$line_space,iconv("UTF-8", "TIS-620",'ฉบับลงวันที่ 13 มิถุนายน 2565'),0,1);

$pdf->SetXY(15,127);
$pdf->Cell(4,4,'',1,0);

$pdf->SetXY(15,133);
$pdf->Cell(4,4,'',1,0);

$pdf->SetXY(15,180);
$pdf->Cell(4,4,'',1,0);

$pdf->SetXY(24,187.5);
$pdf->Cell(4,4,'',1,0);

$pdf->SetXY(59,187.5);
$pdf->Cell(4,4,'',1,0);

$pdf->SetXY(15,194);
$pdf->Cell(4,4,'',1,0);

$pdf->SetFont('THSarabun','',14);
$pdf->setxy(15,20);
$pdf->MultiCell(180,$line_space-2,iconv("UTF-8", "TIS-620",$objective),0,0);

$pdf->setxy(15,99);
$pdf->MultiCell(180,$line_space-2,iconv("UTF-8", "TIS-620",$suggestion),0,0);

if($btnradio5==1){
    $pdf->Image('image/check.png',15,126,5,6);
}else {
    $pdf->Image('image/check.png',15,132,5,6);
}

$pdf->setxy(70,158);
$pdf->Cell(180,$line_space-2,iconv("UTF-8", "TIS-620",$name),0,0);

$pdf->setxy(95,165);
$pdf->Cell(10,$line_space-2,iconv("UTF-8", "TIS-620",$date3),0,0);

$pdf->Output();
}else{ echo('ไม่มีข้อมูล');}

?>
