<?php
if ((isset($_POST["MM_insert"])) && ($_POST["MM_insert"] == "fmadd")) {
require_once("inc/func.php");
$name = stripslashes($_POST["name"]);	
$age = stripslashes($_POST["age"]);
$num_home = stripslashes($_POST["num_home"]);
$Soi = stripslashes($_POST["Soi"]);
$road = stripslashes($_POST["road"]);
$Tambon = stripslashes($_POST["Tambon"]);
$Amphoe = stripslashes($_POST["Amphoe"]);
$province = stripslashes($_POST["province"]);
$postcode = $_POST["postcode"];
$num = $_POST["num"];
$email = $_POST["email"];
$Currently = $_POST["Currently"];
$course = $_POST["course"];
$point = $_POST["point"];
$thesis = $_POST["thesis"];
$advisor = $_POST["advisor"];
$advisor1 = $_POST["advisor1"];
$about = $_POST["about"];
$name1= $_POST["name1"];
$date1 = Day_show($_POST["datenow1"]);	


$line_space=6;

require('vendor/fpdf184/fpdf.php');
$pdf = new FPDF('P','mm','A4');
$pdf->SetMargins(9,6);
$pdf->SetAutoPageBreak(10);
$pdf->AddPage();
$pdf->AddFont('THSarabun','B','THSarabun Bold.php');//ธรรมดา
$pdf->AddFont('THSarabun','','THSarabun.php');//ธรรมดา

//ด้านบน
$pdf->SetFont('THSarabun','B',18);
$pdf->Cell(20);
$pdf->Cell(55,$line_space,iconv("UTF-8", "TIS-620",'ใบสมัครขอรับทุนอุดหนุนการวิจัยในการทำวิทยานิพนธ์สำหรับนิสิตรพดับบัณฑิตศึกษา'),0,1,'c');

$pdf->Cell(60);
$pdf->Cell(55,$line_space,iconv("UTF-8", "TIS-620",'คณะสหเวชศาสตร์ มหาวิทยาลัยนเรศวร '),0,1);

$pdf->Cell(65);
$pdf->Cell(55,$line_space,iconv("UTF-8", "TIS-620",'...................................................'),0,0);

$pdf->SetFont('THSarabun','',16);
$pdf->Cell(55,$line_space,iconv("UTF-8", "TIS-620",''),0,1,'c');
$pdf->Cell(55,$line_space,iconv("UTF-8", "TIS-620",''),0,1,'c');
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",''),0,1);
$pdf->Cell(4);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'(โปรดกรอกใบสมัครด้วยตัวบรรจง)'),0,1);
$pdf->Cell(4);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'1.   ข้าพเจ้า นาย, นาง, นางสาว......................................................................................................................อายุ........................ปี'),0,1);

$pdf->Cell(4);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'2.   ที่อยู่ปัจจุบันเลขที่.............................ซอย.......................ถนน.................................................ตำบล..........................................'),0,1);

$pdf->Cell(10);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'อำเภอ................................................................จังหวัด....................................................รหัสไปรษณีย์.....................................'),0,1);

$pdf->Cell(10);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'เบอร์โทรศัพท์ที่สามารถติดต่อได้สะดวก...............................................Email............................................................................'),0,1);

$pdf->Cell(4);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'3.  ปัจจุบันศึกษาอยู่ระดับ..............................................................................หลักสูตร.....................................................................'),0,1);

$pdf->Cell(4);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'4.  ได้ผลคะแนนการทดสอบภาษาอังกฤษ ซึ่งผ่านเกณฑ์ตามประกาศของมหาวิทยาลัย คือ................................................คะแนน'),0,1);

$pdf->Cell(4);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'5.  ปัจจุบันท่านเคยได้รับทุนอุดหนุนการวิจัยจากแหล่งทุนอื่นหรือไม่'),0,1);

$pdf->Cell(15);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",' เคย (โปรดระบุ)...................................................................................................................................................................'),0,1);

$pdf->Cell(15);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",' ไม่เคย'),0,1);

//check box
$pdf->SetXY(19,94);
$pdf->Cell(5,5,'',1,1);

$pdf->SetXY(19,101);
$pdf->Cell(5,5,'',1,1);

$pdf->Cell(4);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'6.  วิทยานิพนธ์เรื่อง'),0,1);

$pdf->Cell(10);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'...................................................................................................................................................................................................'),0,1);

$pdf->Cell(10);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'อาจารย์ที่ปรึกษา : ....................................................................................................................................................................'),0,1);

$pdf->Cell(10);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'อาจารย์ที่ปรึกษาร่วม : ..............................................................................................................................................................'),0,1);

$pdf->Cell(4);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'7.  สรุปโครงร่างวิทยนิพนธ์ (Summary of Thesis proposal) ไม่เกิน 205 คำ '),0,1);

$pdf->Cell(10);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'...................................................................................................................................................................................................'),0,1);
$pdf->Cell(10);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'...................................................................................................................................................................................................'),0,1);
$pdf->Cell(10);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'...................................................................................................................................................................................................'),0,1);
$pdf->Cell(10);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'...................................................................................................................................................................................................'),0,1);
$pdf->Cell(10);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'...................................................................................................................................................................................................'),0,1);
$pdf->Cell(10);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'...................................................................................................................................................................................................'),0,1);
$pdf->Cell(10);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'...................................................................................................................................................................................................'),0,1);
$pdf->Cell(10);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'...................................................................................................................................................................................................'),0,1);
$pdf->Cell(10);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'...................................................................................................................................................................................................'),0,1);
$pdf->Cell(10);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'...................................................................................................................................................................................................'),0,1);
$pdf->Cell(10);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'...................................................................................................................................................................................................'),0,1);
$pdf->Cell(10);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'...................................................................................................................................................................................................'),0,1);

$pdf->Cell(50);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'ข้าพเจ้ารับรองว่า ข้อความที่กรอกในใบสมัครนี้เป็นความจริงทุกประการ'),0,1);

$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",''),0,1);
$pdf->Cell(130);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'ลงชื่อผู้สมัคร................................................'),0,1);

$pdf->Cell(150);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'(.............................................)'),0,1);

$pdf->Cell(150);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'วันที่........................................'),0,1);

//เส้นกรอบ
$pdf->SetLineWidth(0.2);
$pdf->Rect(20,262,185,28);

$pdf->SetFont('THSarabun','B',14);
$pdf->SetXY(23,263);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'ความเห็นของประธานหลักสูตร/สาขาวิชา'),0,1);

$pdf->SetFont('THSarabun','',14);
$pdf->SetXY(33,268);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'ได้พิจรณาผู้สมัครขอรับทุนอุดหนุนการวิจัยในการทำวิทยานิพนธ์สำหรับนิสิตระดับบัณฑิตศึกษา'),0,1);

$pdf->SetXY(23,273);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'ขอเสนอชื่อ นาย, นาง, นางสาว...........................................................นิสิตระดับปรีญญา..........................สาขาวิชา..........................................'),0,1);

$pdf->SetXY(23,278);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'มีคุณสมบัติเป็นผู้ขอรับทุนอุดหนุนการวิจัยในการทำวิทยานิพนธ์สำหรับนิสิตระดับบัณฑิตศึกษา จึงขอส่งใบสมัครขอรับทุนเพื่อให้'),0,1);

$pdf->SetXY(23,283);
$pdf->Cell(50,$line_space+1,iconv("UTF-8", "TIS-620",'คณะสหเวชศาสตร์ พิจารณา'),0,1);





$pdf->SetFont('THSarabun','',16);

$pdf->MultiCell(195,$line_space,iconv("UTF-8", "TIS-620",''),0,'L');


$pdf->setxy(65,43);
$pdf->Cell(92,$line_space,iconv("UTF-8", "TIS-620",$name),0,0);

$pdf->setxy(182,43);
$pdf->Cell(92,$line_space,iconv("UTF-8", "TIS-620",$age),0,0);

$pdf->setxy(50,50);
$pdf->Cell(92,$line_space,iconv("UTF-8", "TIS-620",$num_home),0,0);

$pdf->setxy(83,50);
$pdf->Cell(92,$line_space,iconv("UTF-8", "TIS-620",$Soi),0,0);

$pdf->setxy(124,50);
$pdf->Cell(92,$line_space,iconv("UTF-8", "TIS-620",$road),0,0);

$pdf->setxy(154,50);
$pdf->Cell(50,$line_space,iconv("UTF-8", "TIS-620",$Tambon),0,0,'C');

$pdf->setxy(32,57);
$pdf->Cell(50,$line_space,iconv("UTF-8", "TIS-620",$Amphoe),0,0,'C');

$pdf->setxy(99,57);
$pdf->Cell(50,$line_space,iconv("UTF-8", "TIS-620",$province),0,0,'C');

$pdf->setxy(175,57);
$pdf->Cell(10,$line_space,iconv("UTF-8", "TIS-620",$postcode),0,0,'C');

$pdf->setxy(87,64);
$pdf->Cell(20,$line_space,iconv("UTF-8", "TIS-620",$num),0,0,'C');

$pdf->setxy(135,64);
$pdf->Cell(50,$line_space,iconv("UTF-8", "TIS-620",$email),0,0,'C');

$pdf->setxy(55,71);
$pdf->Cell(92,$line_space,iconv("UTF-8", "TIS-620",$Currently),0,0);

$pdf->setxy(135,71);
$pdf->Cell(60,$line_space,iconv("UTF-8", "TIS-620",$course),0,0,'C');

$pdf->setxy(161,79);
$pdf->Cell(10,$line_space,iconv("UTF-8", "TIS-620",$point),0,0,'C');

$pdf->SetFont('THSarabun','',16);

$pdf->setxy(23,111);
$pdf->MultiCell(175,$line_space+3,iconv("UTF-8", "TIS-620",$thesis),0,'c');

$pdf->setxy(50,119);
$pdf->Cell(92,$line_space,iconv("UTF-8", "TIS-620",$advisor),0,0);

$pdf->setxy(57,126);
$pdf->Cell(92,$line_space,iconv("UTF-8", "TIS-620",$advisor1),0,0);

$pdf->setxy(162,245);
$pdf->Cell(92,$line_space,iconv("UTF-8", "TIS-620",$name1),0,0);


$pdf->SetFont('THSarabun','',16);
$pdf->setxy(21,140);
$pdf->MultiCell(177,$line_space+1,iconv("UTF-8", "TIS-620",$about),0,'c');

$pdf->SetFont('THSarabun','',14);
//วันที่
$pdf->setxy(168,253);
$pdf->Cell(92,$line_space,iconv("UTF-8", "TIS-620",$date1),0,0);








$pdf->Output();
}else{ echo('ไม่มีข้อมูล');}

?>
